iruka-/ARM_BOOTLOADER/firmware/fm3/drivers/usbf/MB9B500.h
/**
* @file          MB9BF500.h
* @brief         CMSIS Cortex-M3 Core Peripheral Access Layer Header File for
 *               FUJITSU MB9BFxxx Series
* @author        lijiale
* @version       1.00
* @date          2010/08/20
*                  Copyright 2010 FUJITSU ELECTRONICS INC.  LIMITED
**/

#ifndef __MB9B500_H__
#define __MB9B500_H__

/**
 * @brief Interrupt Number Type Definition
 */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn           = -14,  /* 2 Non Maskable Interrupt                             */
    MemoryManagement_IRQn         = -12,  /* 4 Cortex-M3 Memory Management Interrupt              */
    BusFault_IRQn                 = -11,  /* 5 Cortex-M3 Bus Fault Interrupt                      */
    UsageFault_IRQn               = -10,  /* 6 Cortex-M3 Usage Fault Interrupt                    */
    SVCall_IRQn                   = -5,   /* 11 Cortex-M3 SV Call Interrupt                       */
    DebugMonitor_IRQn             = -4,   /* 12 Cortex-M3 Debug Monitor Interrupt                 */
    PendSV_IRQn                   = -2,   /* 14 Cortex-M3 Pend SV Interrupt                       */
    SysTick_IRQn                  = -1,   /* 15 Cortex-M3 System Tick Interrupt                   */

/******  MB9BFxxx Specific Interrupt Numbers ******************************************************/
    FCS_IRQn                      = 0,    /* FCS Interupt                                         */
    WDT_IRQn                      = 1,    /* Watchdog Interupt                                    */
    LVD_IRQn                      = 2,    /* LVD Interupt                                         */
    MFT_IRQn                      = 3,    /* MFT Interupt                                         */
    EXT0_7_IRQn                   = 4,    /* EXT Interupt 0-7                                    */
    EXT8_15_IRQn                  = 5,    /* EXT Interupt 8-15                                   */
    QPRC_IRQn                     = 6,    /* QPRC Interupt Handler                                */
    MSI0_RX_IRQn                  = 7,    /* Multi-function Serial Interface receive Interupt 0   */
    MSI0_TX_IRQn                  = 8,    /* Multi-function Serial Interface send Interupt 0      */
    MSI1_RX_IRQn                  = 9,    /* Multi-function Serial Interface receive Interupt 1   */
    MSI1_TX_IRQn                  = 10,   /* Multi-function Serial Interface send Interupt 1      */
    MSI2_RX_IRQn                  = 11,   /* Multi-function Serial Interface receive Interupt 2   */
    MSI2_TX_IRQn                  = 12,   /* Multi-function Serial Interface send Interupt 2      */
    MSI3_RX_IRQn                  = 13,   /* Multi-function Serial Interface receive Interupt 3   */
    MSI3_TX_IRQn                  = 14,   /* Multi-function Serial Interface send Interupt 3      */
    MSI4_RX_IRQn                  = 15,   /* Multi-function Serial Interface receive Interupt 4   */
    MSI4_TX_IRQn                  = 16,   /* Multi-function Serial Interface send Interupt 4      */
    MSI5_RX_IRQn                  = 17,   /* Multi-function Serial Interface receive Interupt 5   */
    MSI5_TX_IRQn                  = 18,   /* Multi-function Serial Interface send Interupt 5      */
    MSI6_RX_IRQn                  = 19,   /* Multi-function Serial Interface receive Interupt 6   */
    MSI6_TX_IRQn                  = 20,   /* Multi-function Serial Interface send Interupt 6      */
    MSI7_RX_IRQn                  = 21,   /* Multi-function Serial Interface receive Interupt 7   */
    MSI7_TX_IRQn                  = 22,   /* Multi-function Serial Interface send Interupt 7      */
    PPG_IRQn                      = 23,   /* PPG Interupt                                         */
    OSC_IRQn                      = 24,   /* OSC Interupt                                         */
    AD0_IRQn                      = 25,   /* AD0 Interupt                                         */
    AD1_IRQn                      = 26,   /* AD1 Interupt                                         */
    AD2_IRQn                      = 27,   /* AD2 Interupt                                         */
    MFT_FRT_IRQn                  = 28,   /* MFT Free-Run Timer Interupt                          */
    MFT_IC_IRQn                   = 29,   /* MFT Input Capture Interupt                           */
    MFT_OC_IRQn                   = 30,   /* MFT Output Compare Interupt                          */
    BT_IRQn                       = 31,   /* Base Timer Interupt                                  */
    CAN0_IRQn                     = 32,   /* CAN0 Interupt                                        */
    CAN1_IRQn                     = 33,   /* CAN1 Interupt                                        */
    USB1_IRQn                     = 34,   /* USB function(DRQ of End Point 1 to 5) Interupt       */
    USB2_IRQn                     = 35,   /* USB function(DRQI, DRQO of End Point 0 and each status) and USB HOST (Each status) Interupt */
    DMA0_IRQn                     = 38,   /* DMA0 Interupt                                        */
    DMA1_IRQn                     = 39,   /* DMA1 Interupt                                        */
    DMA2_IRQn                     = 40,   /* DMA2 Interupt                                        */
    DMA3_IRQn                     = 41,   /* DMA3 Interupt                                        */
    DMA4_IRQn                     = 42,   /* DMA4 Interupt                                        */
    DMA5_IRQn                     = 43,   /* DMA5 Interupt                                        */
    DMA6_IRQn                     = 44,   /* DMA6 Interupt                                        */
    DMA7_IRQn                     = 45    /* DMA7 Interupt                                        */
} IRQn_Type;


/*----------------------------------------------------------------------------*/
/* Constant Definition                                                        */
/*----------------------------------------------------------------------------*/
/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __MPU_PRESENT             1         /* MPU present or not                               */
#define __NVIC_PRIO_BITS          4         /* Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig    0         /* Set to 1 if different SysTick Config is used     */

