iruka-/ARM_BOOTLOADER/firmware/fm3/drivers/usbf/MB9B500.h
/*----------------------------------------------------------------------------*/
/* Headers                                                                    */
/*----------------------------------------------------------------------------*/
#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals         */

/*----------------------------------------------------------------------------*/
/*  Struct Definition                                                         */
/*----------------------------------------------------------------------------*/
/* struct of clock generation register */
typedef union {
    uint8_t  byte;
    struct {
                 uint8_t  RESV2:1;
            __IO uint8_t  MOSCE:1;
                 uint8_t  RESV1:1;
            __IO uint8_t  SOSCE:1;
            __IO uint8_t  PLLE :1;
            __IO uint8_t  RCS  :3;
    } bit;
} SCM_CTL;

typedef union {
    uint8_t  byte;
    struct {
                 uint8_t  RESV2:1;
             __I uint8_t  MORDY:1;
                 uint8_t  RESV1:1;
             __I uint8_t  SORDY:1;
             __I uint8_t  PLRDY:1;
             __I uint8_t  RCM  :3;
    } bit;
} SCM_STR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  BSR  :3;
                 uint8_t  RESV1:5;
    } bit;
} BSC_PSR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  APBC0:2;
                 uint8_t  RESV1:6;
    } bit;
} APBC0_PSR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  APBC1   :2;
                 uint8_t  RESV2   :2;
            __IO uint8_t  APBC1RST:1;
                 uint8_t  RESV1   :2;
            __IO uint8_t  APBC1EN :1;
    } bit;
} APBC1_PSR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  APBC2   :2;
                 uint8_t  RESV2   :2;
            __IO uint8_t  APBC2RST:1;
                 uint8_t  RESV1   :2;
            __IO uint8_t  APBC2EN :1;
    } bit;
} APBC2_PSR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  SWDS  :2;
                 uint8_t  RESV1 :5;
            __IO uint8_t  TESTB :1;
    } bit;
} SWC_PSR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  TTC  :1;
                 uint8_t  RESV1:7;
    } bit;
} TTC_PSR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  MOWT :4;
            __IO uint8_t  SOWT :3;
                 uint8_t  RESV1:1;
    } bit;
} CSW_TMR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  PWOT :3;
                 uint8_t  RESV2:1;
            __IO uint8_t  PINC :1;
                 uint8_t  RESV1:3;
    } bit;
} PSW_TMR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  PLLM:4;
            __IO uint8_t  PLLK:4;
    } bit;
} PLL_CTL1;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  PLLN:5;
                 uint8_t  RESV1:3;
    } bit;
} PLL_CTL2;

typedef union {
    uint8_t  byte;
    struct {
                 uint8_t  RESV2 :5;
            __IO uint8_t  DPSWBE:1;
                 uint8_t  RESV1 :1;
            __IO uint8_t  DPHWBE:1;
    } bit;
} DBWDT_CTL;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  MCSE :1;
            __IO uint8_t  SCSE :1;
            __IO uint8_t  PCSE :1;
                 uint8_t  RESV2:2;
            __IO uint8_t  FCSE :1;
                 uint8_t  RESV1:2;
    } bit;
} INT_ENR;

typedef union {
    uint8_t  byte;
    struct {
             __I uint8_t  MCSI :1;
             __I uint8_t  SCSI :1;
             __I uint8_t  PCSI :1;
                 uint8_t  RESV2:2;
             __I uint8_t  FCSI :1;
                 uint8_t  RESV1:2;
    } bit;
} INT_STR;

typedef union {
    uint8_t  byte;
    struct {
             __O uint8_t  MCSC :1;
             __O uint8_t  SCSC :1;
             __O uint8_t  PCSC :1;
                 uint8_t  RESV2:2;
             __O uint8_t  FCSC :1;
                 uint8_t  RESV1:2;
    } bit;
} INT_CLR;

/* struct of USB clock generation register */
typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  UCEN :1;
            __IO uint8_t  UCSEL:1;
                 uint8_t  RESV1:6;
    } bit;
} UCCR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  UPLLEN:1;
            __IO uint8_t  UPINC :1;
                 uint8_t  RESV1 :6;
    } bit;
} UPCR1;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  UPOWT:3;
                 uint8_t  RESV1:5;
    } bit;
} UPCR2;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  UPLLK:5;
                 uint8_t  RESV1:3;
    } bit;
} UPCR3;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  UPLLN:5;
                 uint8_t  RESV1:3;
    } bit;
} UPCR4;

typedef union {
    uint8_t  byte;
    struct {
             __I uint8_t  UPRDY:1;
                 uint8_t  RESV1:7;
    } bit;
} UP_STR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  UPCSE:1;
                 uint8_t  RESV1:7;
    } bit;
} UPINT_ENR;

typedef union {
    uint8_t  byte;
    struct {
             __I uint8_t  UPCSI:1;
                 uint8_t  RESV1:7;
    } bit;
} UPINT_STR;

typedef union {
    uint8_t  byte;
    struct {
             __O uint8_t  UPCSC:1;
                 uint8_t  RESV1:7;
    } bit;
} UPINT_CLR;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  USBEN:1;
                 uint8_t  RESV1:7;
    } bit;
} USBEN;


/* USB function */
typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  PWC:1;
            __IO uint8_t  RFBK:1;
                 uint8_t  RESV2:1;
            __IO uint8_t  STALCLREN:1;
            __IO uint8_t  USTP:1;
            __IO uint8_t  HCONX:1;
            __IO uint8_t  RESUM:1;
            __IO uint8_t  RST:1;
                 uint8_t  RESV1:8;
    } bit;
} UDCC;

