iruka-/ARM_BOOTLOADER/firmware/fm3/drivers/usbf/MB9B500.h
typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  PKS0:7;
                 uint8_t  RESV8:1;
                 uint8_t  RESV7:1;
            __IO uint8_t  STAL:1;
                 uint8_t  RESV5:1;
                 uint8_t  RESV4:1;
                 uint8_t  RESV3:1;
                 uint8_t  RESV2:1;
                 uint8_t  RESV1:1;
                 uint8_t  RESV0:1;
    } bit;
} EP0C;

typedef union {
    uint16_t hword;
    struct {
            __IO uint16_t PKS1:9;
            __IO uint8_t  STAL:1;
            __IO uint8_t  NULE:1;
            __IO uint8_t  DMAE:1;
            __IO uint8_t  DIR:1;
            __IO uint8_t  TYPE:2;
            __IO uint8_t  EPEN:1;
    } bit;
} EP1C;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  PKS2:7;
                 uint8_t  RESV7:1;
                 uint8_t  RESV6:1;
            __IO uint8_t  STAL:1;
            __IO uint8_t  NULE:1;
            __IO uint8_t  DMAE:1;
            __IO uint8_t  DIR:1;
            __IO uint8_t  TYPE:2;
            __IO uint8_t  EPEN:1;
    } bit;
} EP2C,EP3C,EP4C,EP5C;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  CONF:1;
            __IO uint8_t  SETP:1;
            __IO uint8_t  WKUP:1;
            __IO uint8_t  BRST:1;
            __IO uint8_t  SOF:1;
            __IO uint8_t  SUSP:1;
                 uint8_t  RESV1:1;
                 uint8_t  RESV0:1;
    } bit;
} UDCS;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  CONFIE:1;
            __I  uint8_t  CONFN:1;
            __IO uint8_t  WKUPIE:1;
            __IO uint8_t  BRSTIE:1;
            __IO uint8_t  SOFIE:1;
            __IO uint8_t  SUSPIE:1;
                 uint8_t  RESV1:1;
                 uint8_t  RESV0:1;
    } bit;
} UDCIE;

typedef union {
    uint16_t hword;
    struct {
                 uint8_t  RESV15:1;
                 uint8_t  RESV14:1;
                 uint8_t  RESV13:1;
                 uint8_t  RESV12:1;
                 uint8_t  RESV11:1;
                 uint8_t  RESV10:1;
                 uint8_t  RESV9:1;
                 uint8_t  RESV8:1;
                 uint8_t  RESV7:1;
                 uint8_t  RESV6:1;
            __IO uint8_t  DRQI:1;
                 uint8_t  RESV4:1;
                 uint8_t  RESV3:1;
                 uint8_t  RESV2:1;
            __IO uint8_t  DRQIIE:1;
            __IO uint8_t  BFINI:1;
    } bit;
} EP0IS;

typedef union {
    uint16_t hword;
    struct {
            __I  uint8_t  SIZE:7;
                 uint8_t  RESV8:1;
                 uint8_t  RESV7:1;
            __IO uint8_t  SPK:1;
            __IO uint8_t  DRQO:1;
                 uint8_t  RESV4:1;
                 uint8_t  RESV3:1;
            __IO uint8_t  SPKIE:1;
            __IO uint8_t  DRQOIE:1;
            __IO uint8_t  BFINI:1;
    } bit;
} EP0OS;

typedef union {
    uint16_t hword;
    struct {
            __I  uint16_t SIZE:9;
            __IO uint8_t  SPK:1;
            __IO uint8_t  DRQ:1;
            __I  uint8_t  BUSY:1;
                 uint8_t  RESV3:1;
            __IO uint8_t  SPKIE:1;
            __IO uint8_t  DRQIE:1;
            __IO uint8_t  BFINI:1;
    } bit;
} EP1S;

typedef union {
    uint16_t hword;
    struct {
            __I  uint8_t  SIZE:7;
                 uint8_t  RESV8:1;
                 uint8_t  RESV7:1;
            __IO uint8_t  SPK:1;
            __IO uint8_t  DRQ:1;
            __I  uint8_t  BUSY:1;
                 uint8_t  RESV3:1;
            __IO uint8_t  SPKIE:1;
            __IO uint8_t  DRQIE:1;
            __IO uint8_t  BFINI:1;
    } bit;
} EP2S,EP3S,EP4S,EP5S;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  EP0DTL;
            __IO uint8_t  EP0DTH;
    } byte;
} EP0DT;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  EP1DTL;
            __IO uint8_t  EP1DTH;
    } byte;
} EP1DT;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  EP2DTL;
            __IO uint8_t  EP2DTH;
    } byte;
} EP2DT;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  EP3DTL;
            __IO uint8_t  EP3DTH;
    } byte;
} EP3DT;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  EP4DTL;
            __IO uint8_t  EP4DTH;
    } byte;
} EP4DT;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  EP5DTL;
            __IO uint8_t  EP5DTH;
    } byte;
} EP5DT;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  HOST:1;
            __IO uint8_t  URST:1;
            __IO uint8_t  SOFIRE:1;
            __IO uint8_t  DIRE:1;
            __IO uint8_t  CNNIRE:1;
            __IO uint8_t  CMPIRE:1;
            __IO uint8_t  URIRE:1;
            __IO uint8_t  RWKIRE:1;
            __IO uint8_t  RETRY:1;
            __IO uint8_t  CANCEL:1;
            __IO uint8_t  SOFSTEP:1;
            __IO uint8_t  RESV4:1;
            __IO uint8_t  RESV3:1;
            __IO uint8_t  RESV2:1;
            __IO uint8_t  RESV1:1;
            __IO uint8_t  RESV0:1;
    } bit;
} HCNT;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  SOFIRQ:1;
            __IO uint8_t  DIRQ:1;
            __IO uint8_t  CNNIRQ:1;
            __IO uint8_t  CMPIRQ:1;
            __IO uint8_t  URIRQ:1;
            __IO uint8_t  RWKIRQ:1;
            __IO uint8_t  RESV1:1;
            __IO uint8_t  TCAN:1;
    } bit;
} HIRQ;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  HS:2;
            __IO uint8_t  STUFF:1;
            __IO uint8_t  TGERR:1;
            __IO uint8_t  CRC:1;
            __IO uint8_t  TOUT:1;
            __IO uint8_t  RERR:1;
            __IO uint8_t  LSTSOF:1;
    } bit;
} HERR;

typedef union {
    uint8_t  byte;
    struct {
            __I  uint8_t  CSTAT:1;
            __I  uint8_t  TMODE:1;
            __IO uint8_t  SUSP:1;
            __IO uint8_t  SOFBUSY:1;
            __IO uint8_t  CLKSEL:1;
            __IO uint8_t  ALIVE:1;
                 uint8_t  RESV1:1;
                 uint8_t  RESV0:1;
    } bit;
} HSTATE;

