iruka-/ARM_BOOTLOADER/firmware/fm3/drivers/usbf/MB9B500.h
typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  EOF0:8;
            __IO uint8_t  EOF1:6;
                 uint8_t  RESV1:1;
                 uint8_t  RESV0:1;
    } bit;
} HEOF;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  FRAME0:8;
            __IO uint8_t  FRAME1:3;
                 uint8_t  RESV4:1;
                 uint8_t  RESV3:1;
                 uint8_t  RESV2:1;
                 uint8_t  RESV1:1;
                 uint8_t  RESV0:1;
    } bit;
} HFRAME;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  ENDPT:4;
            __IO uint8_t  TKNEN:3;
            __IO uint8_t  TGGL:1;
    } bit;
} HTOKEN;


/* struct of DMA control register */
typedef union {
    uint32_t  word;
    struct {
            __IO uint32_t  RESV2:24;
            __IO uint8_t  DH:4;
            __IO uint8_t  PR:1;
            __IO uint8_t  RESV1:1;
            __IO uint8_t  DS:1;
            __IO uint8_t  DE:1;
    } bit;
} DMACR;

typedef union {
    uint32_t  word;
    struct {
            __IO uint16_t TC:16;
            __IO uint8_t  BC:4;
            __IO uint8_t  RESV1:3;
            __IO uint8_t  IS2:1;
            __IO uint8_t  IS1:5;
            __IO uint8_t  ST:1;
            __IO uint8_t  PB:1;
            __IO uint8_t  EB:1;
    } bit;
} DMACA0,DMACA1;

typedef union {
    uint32_t  word;
    struct {
            __IO uint8_t  EM:1;
            __IO uint8_t  RESV2:7;
            __IO uint8_t  DP:4;
            __IO uint8_t  SP:4;
            __IO uint8_t  SS:3;
            __IO uint8_t  CI:1;
            __IO uint8_t  EI:1;
            __IO uint8_t  RD:1;
            __IO uint8_t  RS:1;
            __IO uint8_t  RC:1;
            __IO uint8_t  FD:1;
            __IO uint8_t  FS:1;
            __IO uint8_t  TW:2;
            __IO uint8_t  MS:2;
            __IO uint8_t  RESV1:2;
    } bit;
} DMACB0,DMACB1;


/* struct of I/O port control register */
typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  P00:1;
            __IO uint8_t  P01:1;
            __IO uint8_t  P02:1;
            __IO uint8_t  P03:1;
            __IO uint8_t  P04:1;
            __IO uint8_t  P05:1;
            __IO uint8_t  P06:1;
            __IO uint8_t  P07:1;
            __IO uint8_t  P08:1;
            __IO uint8_t  P09:1;
            __IO uint8_t  P0A:1;
            __IO uint8_t  P0B:1;
            __IO uint8_t  P0C:1;
            __IO uint8_t  P0D:1;
            __IO uint8_t  P0E:1;
            __IO uint8_t  P0F:1;
    } bit;
} PFR0,PCR0,DDR0,PDIR0,PDOR0;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  P10:1;
            __IO uint8_t  P11:1;
            __IO uint8_t  P12:1;
            __IO uint8_t  P13:1;
            __IO uint8_t  P14:1;
            __IO uint8_t  P15:1;
            __IO uint8_t  P16:1;
            __IO uint8_t  P17:1;
            __IO uint8_t  P18:1;
            __IO uint8_t  P19:1;
            __IO uint8_t  P1A:1;
            __IO uint8_t  P1B:1;
            __IO uint8_t  P1C:1;
            __IO uint8_t  P1D:1;
            __IO uint8_t  P1E:1;
            __IO uint8_t  P1F:1;
    } bit;
} PFR1,PCR1,DDR1,PDIR1,PDOR1,ADE;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  P20:1;
            __IO uint8_t  P21:1;
            __IO uint8_t  P22:1;
            __IO uint8_t  P23:1;
            __IO uint8_t  P24:1;
            __IO uint8_t  P25:1;
            __IO uint8_t  P26:1;
            __IO uint8_t  P27:1;
            __IO uint8_t  P28:1;
            __IO uint8_t  P29:1;
            __IO uint8_t  P2A:1;
            __IO uint8_t  P2B:1;
            __IO uint8_t  P2C:1;
            __IO uint8_t  P2D:1;
            __IO uint8_t  P2E:1;
            __IO uint8_t  P2F:1;
    } bit;
} PFR2,PCR2,DDR2,PDIR2,PDOR2;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  P30:1;
            __IO uint8_t  P31:1;
            __IO uint8_t  P32:1;
            __IO uint8_t  P33:1;
            __IO uint8_t  P34:1;
            __IO uint8_t  P35:1;
            __IO uint8_t  P36:1;
            __IO uint8_t  P37:1;
            __IO uint8_t  P38:1;
            __IO uint8_t  P39:1;
            __IO uint8_t  P3A:1;
            __IO uint8_t  P3B:1;
            __IO uint8_t  P3C:1;
            __IO uint8_t  P3D:1;
            __IO uint8_t  P3E:1;
            __IO uint8_t  P3F:1;
    } bit;
} PFR3,PCR3,DDR3,PDIR3,PDOR3;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  P40:1;
            __IO uint8_t  P41:1;
            __IO uint8_t  P42:1;
            __IO uint8_t  P43:1;
            __IO uint8_t  P44:1;
            __IO uint8_t  P45:1;
            __IO uint8_t  P46:1;
            __IO uint8_t  P47:1;
            __IO uint8_t  P48:1;
            __IO uint8_t  P49:1;
            __IO uint8_t  P4A:1;
            __IO uint8_t  P4B:1;
            __IO uint8_t  P4C:1;
            __IO uint8_t  P4D:1;
            __IO uint8_t  P4E:1;
            __IO uint8_t  P4F:1;
    } bit;
} PFR4,PCR4,DDR4,PDIR4,PDOR4;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  P50:1;
            __IO uint8_t  P51:1;
            __IO uint8_t  P52:1;
            __IO uint8_t  P53:1;
            __IO uint8_t  P54:1;
            __IO uint8_t  P55:1;
            __IO uint8_t  P56:1;
            __IO uint8_t  P57:1;
            __IO uint8_t  P58:1;
            __IO uint8_t  P59:1;
            __IO uint8_t  P5A:1;
            __IO uint8_t  P5B:1;
            __IO uint8_t  P5C:1;
            __IO uint8_t  P5D:1;
            __IO uint8_t  P5E:1;
            __IO uint8_t  P5F:1;
    } bit;
} PFR5,PCR5,DDR5,PDIR5,PDOR5;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  P60:1;
            __IO uint8_t  P61:1;
            __IO uint8_t  P62:1;
            __IO uint8_t  P63:1;
            __IO uint8_t  P64:1;
            __IO uint8_t  P65:1;
            __IO uint8_t  P66:1;
            __IO uint8_t  P67:1;
            __IO uint8_t  P68:1;
            __IO uint8_t  P69:1;
            __IO uint8_t  P6A:1;
            __IO uint8_t  P6B:1;
            __IO uint8_t  P6C:1;
            __IO uint8_t  P6D:1;
            __IO uint8_t  P6E:1;
            __IO uint8_t  P6F:1;
    } bit;
} PFR6,PCR6,DDR6,PDIR6,PDOR6;

