iruka-/ARM_BOOTLOADER/firmware/fm3/drivers/usbf/MB9B500.h
typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  P70:1;
            __IO uint8_t  P71:1;
            __IO uint8_t  P72:1;
            __IO uint8_t  P73:1;
            __IO uint8_t  P74:1;
            __IO uint8_t  P75:1;
            __IO uint8_t  P76:1;
            __IO uint8_t  P77:1;
            __IO uint8_t  P78:1;
            __IO uint8_t  P79:1;
            __IO uint8_t  P7A:1;
            __IO uint8_t  P7B:1;
            __IO uint8_t  P7C:1;
            __IO uint8_t  P7D:1;
            __IO uint8_t  P7E:1;
            __IO uint8_t  P7F:1;
    } bit;
} PFR7,PCR7,DDR7,PDIR7,PDOR7;

typedef union {
    uint32_t  word;
    struct {
            __IO uint8_t  NMIS:1;
            __IO uint8_t  CROUTE:1;
                 uint8_t  RESV5:6;
                 uint8_t  RESV4:1;
            __IO uint8_t  USB0PE:1;
                 uint8_t  RESV3:6;
            __IO uint8_t  JTAGEN0B:1;
            __IO uint8_t  JTAGEN1S:1;
                 uint8_t  RESV2:6;
            __IO uint8_t  TRC0E:1;
            __IO uint8_t  TRC1E:1;
                 uint8_t  RESV1:6;
    } bit;
} EPFR00;

typedef union {
    uint32_t  word;
    struct {
            __IO uint8_t  RTO00E:2;
            __IO uint8_t  RTO01E:2;
            __IO uint8_t  RTO02E:2;
            __IO uint8_t  RTO03E:2;
            __IO uint8_t  RTO04E:2;
            __IO uint8_t  RTO05E:2;
            __IO uint8_t  DTTI0C:1;
                 uint8_t  RESV1:3;
            __IO uint8_t  DTTI0S:2;
            __IO uint8_t  FRCK0S:2;
            __IO uint8_t  IC00S:3;
            __IO uint8_t  IC01S:3;
            __IO uint8_t  IC02S:3;
            __IO uint8_t  IC03S:3;
    } bit;
} EPFR01;

typedef union {
    uint32_t  word;
    struct {
            __IO uint8_t  RTO10E:2;
            __IO uint8_t  RTO11E:2;
            __IO uint8_t  RTO12E:2;
            __IO uint8_t  RTO13E:2;
            __IO uint8_t  RTO14E:2;
            __IO uint8_t  RTO15E:2;
            __IO uint8_t  DTTI1C:1;
                 uint8_t  RESV1:3;
            __IO uint8_t  DTTI1S:2;
            __IO uint8_t  FRCK1S:2;
            __IO uint8_t  IC10S:3;
            __IO uint8_t  IC11S:3;
            __IO uint8_t  IC12S:3;
            __IO uint8_t  IC13S:3;
    } bit;
} EPFR02;

typedef union {
    uint32_t  word;
    struct {
                 uint8_t  RESV6:2;
            __IO uint8_t  TIOA0E:2;
            __IO uint8_t  TIOB0S:2;
                 uint8_t  RESV5:2;
            __IO uint8_t  TIOA1S:2;
            __IO uint8_t  TIOA1E:2;
            __IO uint8_t  TIOB1S:2;
                 uint8_t  RESV4:2;
                 uint8_t  RESV3:2;
            __IO uint8_t  TIOA2E:2;
            __IO uint8_t  TIOB2S:2;
                 uint8_t  RESV2:2;
            __IO uint8_t  TIOA3S:2;
            __IO uint8_t  TIOA3E:2;
            __IO uint8_t  TIOB3S:2;
                 uint8_t  RESV1:2;
    } bit;
} EPFR04;

typedef union {
    uint32_t  word;
    struct {
                 uint8_t  RESV6:2;
            __IO uint8_t  TIOA4E:2;
            __IO uint8_t  TIOB4S:2;
                 uint8_t  RESV5:2;
            __IO uint8_t  TIOA5S:2;
            __IO uint8_t  TIOA5E:2;
            __IO uint8_t  TIOB5S:2;
                 uint8_t  RESV4:2;
                 uint8_t  RESV3:2;
            __IO uint8_t  TIOA6E:2;
            __IO uint8_t  TIOB6S:2;
                 uint8_t  RESV2:2;
            __IO uint8_t  TIOA7S:2;
            __IO uint8_t  TIOA7E:2;
            __IO uint8_t  TIOB7S:2;
                 uint8_t  RESV1:2;
    } bit;
} EPFR05;

typedef union {
    uint32_t  word;
    struct {
            __IO uint8_t  EINT00S:2;
            __IO uint8_t  EINT01S:2;
            __IO uint8_t  EINT02S:2;
            __IO uint8_t  EINT03S:2;
            __IO uint8_t  EINT04S:2;
            __IO uint8_t  EINT05S:2;
            __IO uint8_t  EINT06S:2;
            __IO uint8_t  EINT07S:2;
            __IO uint8_t  EINT08S:2;
            __IO uint8_t  EINT09S:2;
            __IO uint8_t  EINT10S:2;
            __IO uint8_t  EINT11S:2;
            __IO uint8_t  EINT12S:2;
            __IO uint8_t  EINT13S:2;
            __IO uint8_t  EINT14S:2;
            __IO uint8_t  EINT15S:2;
    } bit;
} EPFR06;

typedef union {
    uint32_t  word;
    struct {
                 uint8_t  RESV2:4;
            __IO uint8_t  SIN0S:2;
            __IO uint8_t  SOT0B:2;
            __IO uint8_t  SCK0B:2;
            __IO uint8_t  SIN1S:2;
            __IO uint8_t  SOT1B:2;
            __IO uint8_t  SCK1B:2;
            __IO uint8_t  SIN2S:2;
            __IO uint8_t  SOT2B:2;
            __IO uint8_t  SCK2B:2;
            __IO uint8_t  SIN3S:2;
            __IO uint8_t  SOT3B:2;
            __IO uint8_t  SCK3B:2;
                 uint8_t  RESV1:4;
    } bit;
} EPFR07;

typedef union {
    uint32_t  word;
    struct {
            __IO uint8_t  RTS4E:2;
            __IO uint8_t  CTS4S:2;
            __IO uint8_t  SIN4S:2;
            __IO uint8_t  SOT4B:2;
            __IO uint8_t  SCK4B:2;
            __IO uint8_t  SIN5S:2;
            __IO uint8_t  SOT5B:2;
            __IO uint8_t  SCK5B:2;
            __IO uint8_t  SIN6S:2;
            __IO uint8_t  SOT6B:2;
            __IO uint8_t  SCK6B:2;
            __IO uint8_t  SIN7S:2;
            __IO uint8_t  SOT7B:2;
            __IO uint8_t  SCK7B:2;
                 uint8_t  RESV1:4;
    } bit;
} EPFR08;

typedef union {
    uint32_t  word;
    struct {
            __IO uint8_t  QAIN0S:2;
            __IO uint8_t  QBIN0S:2;
            __IO uint8_t  QZIN0S:2;
            __IO uint8_t  QAIN1S:2;
            __IO uint8_t  QBIN1S:2;
            __IO uint8_t  QZIN1S:2;
            __IO uint8_t  ADTRG0S:4;
            __IO uint8_t  ADTRG1S:4;
            __IO uint8_t  ADTRG2S:4;
            __IO uint8_t  CRX0S:2;
            __IO uint8_t  CTX0E:2;
            __IO uint8_t  CRX1S:2;
            __IO uint8_t  CTX1E:2;
    } bit;
} EPFR09;

