iruka-/ARM_BOOTLOADER/firmware/fm3/drivers/usbf/MB9B500.h
typedef union {
    uint32_t  word;
    struct {
            __IO uint8_t  UEDEFB:1;
            __IO uint8_t  UEDTHB:1;
            __IO uint8_t  TESTB:1;
            __IO uint8_t  UEWEXE:1;
            __IO uint8_t  UEDQME:1;
            __IO uint8_t  UEOEXE:1;
            __IO uint8_t  UEFLSE:1;
            __IO uint8_t  UECS1E:1;
            __IO uint8_t  UECS2E:1;
            __IO uint8_t  UECS3E:1;
            __IO uint8_t  UECS4E:1;
            __IO uint8_t  UECS5E:1;
            __IO uint8_t  UECS6E:1;
            __IO uint8_t  UECS7E:1;
            __IO uint8_t  UEAOOE:1;
            __IO uint8_t  UEA08E:1;
            __IO uint8_t  UEA09E:1;
            __IO uint8_t  UEA10E:1;
            __IO uint8_t  UEA11E:1;
            __IO uint8_t  UEA12E:1;
            __IO uint8_t  UEA13E:1;
            __IO uint8_t  UEA14E:1;
            __IO uint8_t  UEA15E:1;
            __IO uint8_t  UEA16E:1;
            __IO uint8_t  UEA17E:1;
            __IO uint8_t  UEA18E:1;
            __IO uint8_t  UEA19E:1;
            __IO uint8_t  UEA20E:1;
            __IO uint8_t  UEA21E:1;
            __IO uint8_t  UEA22E:1;
            __IO uint8_t  UEA23E:1;
            __IO uint8_t  UEA24E:1;
    } bit;
} EPFR10;


/* struct of base timer register */
typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  SEL01:4;
            __IO uint8_t  SEL23:4;
    } bit;
} BTSEL0123;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  SEL45:4;
            __IO uint8_t  SEL67:4;
    } bit;
} BTSEL4567;

typedef union {
    uint16_t hword;
    struct {
            __O  uint8_t  SSSR0:1;
            __O  uint8_t  SSSR1:1;
            __O  uint8_t  SSSR2:1;
            __O  uint8_t  SSSR3:1;
            __O  uint8_t  SSSR4:1;
            __O  uint8_t  SSSR5:1;
            __O  uint8_t  SSSR6:1;
            __O  uint8_t  SSSR7:1;
            __O  uint8_t  SSSR8:1;
            __O  uint8_t  SSSR9:1;
            __O  uint8_t  SSSR10:1;
            __O  uint8_t  SSSR11:1;
            __O  uint8_t  SSSR12:1;
            __O  uint8_t  SSSR13:1;
            __O  uint8_t  SSSR14:1;
            __O  uint8_t  SSSR15:1;
    } bit;
} BTSSSR;

typedef union {
    uint16_t hword;
    struct {
            __IO uint8_t  STRG:1;
            __IO uint8_t  CTEN:1;
            __IO uint8_t  MDSE:1;
            __IO uint8_t  OSEL:1;
            __IO uint8_t  FMD:3;
            __IO uint8_t  RESV2:1;
            __IO uint8_t  EGS:2;
            __IO uint8_t  PMSK:1;
            __IO uint8_t  RTGEN:1;
            __IO uint8_t  CKS210:3;
            __IO uint8_t  RESV1:1;
    } bit;
} TMCR0,TMCR1,TMCR2,TMCR3,TMCR4,TMCR5,TMCR6,TMCR7;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  CKS3:1;
            __IO uint8_t  RESV7:1;
            __IO uint8_t  RESV6:1;
            __IO uint8_t  RESV5:1;
            __IO uint8_t  RESV4:1;
            __IO uint8_t  RESV3:1;
            __IO uint8_t  RESV2:1;
            __IO uint8_t  RESV1:1;
    } bit;
} TMCR20,TMCR21,TMCR22,TMCR23,TMCR24,TMCR25,TMCR26,TMCR27;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  UDIR:1;
            __IO uint8_t  DTIR:1;
            __IO uint8_t  TGIR:1;
            __IO uint8_t  RESV2:1;
            __IO uint8_t  UDIE:1;
            __IO uint8_t  DTIE:1;
            __IO uint8_t  TGIE:1;
            __IO uint8_t  RESV1:1;
    } bit;
} STC0,STC1,STC2,STC3,STC4,STC5,STC6,STC7;

/* struct of CSIO control register */
typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  TXE:1;
            __IO uint8_t  RXE:1;
            __IO uint8_t  TBIE:1;
            __IO uint8_t  TIE:1;
            __IO uint8_t  RIE:1;
            __IO uint8_t  SPI:1;
            __IO uint8_t  MS:1;
            __IO uint8_t  UPCL:1;
    } bit;
} SCR0,SCR1,SCR2,SCR3,SCR4,SCR5,SCR6,SCR7;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  SOE:1;
            __IO uint8_t  SCKE:1;
            __IO uint8_t  BDS:1;
            __IO uint8_t  SCINV:1;
            __IO uint8_t  WUCR:1;
            __IO uint8_t  MD:3;
    } bit;
} SMR0,SMR1,SMR2,SMR3,SMR4,SMR5,SMR6,SMR7;

typedef union {
    uint8_t  byte;
    struct {
            __I  uint8_t  TBI:1;
            __I  uint8_t  TDRE:1;
            __I  uint8_t  RDRF:1;
            __I  uint8_t  ORE:1;
                 uint8_t  RESV3:1;
                 uint8_t  RESV2:1;
                 uint8_t  RESV1:1;
            __IO uint8_t  REC:1;
    } bit;
} SSR0,SSR1,SSR2,SSR3,SSR4,SSR5,SSR6,SSR7;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  L:3;
            __IO uint8_t  WT:2;
                 uint8_t  RESV2:1;
                 uint8_t  RESV1:1;
            __IO uint8_t  SOP:1;
    } bit;
} ESCR0,ESCR1,ESCR2,ESCR3,ESCR4,ESCR5,ESCR6,ESCR7;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  SM0:1;
            __IO uint8_t  SM1:1;
            __IO uint8_t  SM2:1;
            __IO uint8_t  SM3:1;
            __IO uint8_t  SM4:1;
            __IO uint8_t  SM5:1;
            __IO uint8_t  SM6:1;
            __IO uint8_t  EN:1;
    } bit;
} ISMK0,ISMK1,ISMK2,ISMK3,ISMK4,ISMK5,ISMK6,ISMK7;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  SA0:1;
            __IO uint8_t  SA1:1;
            __IO uint8_t  SA2:1;
            __IO uint8_t  SA3:1;
            __IO uint8_t  SA4:1;
            __IO uint8_t  SA5:1;
            __IO uint8_t  SA6:1;
            __IO uint8_t  SAEN:1;
    } bit;
} ISBA0,ISBA1,ISBA2,ISBA3,ISBA4,ISBA5,ISBA6,ISBA7;

typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  FSEL:1;
            __IO uint8_t  FTIE:1;
            __IO uint8_t  FDRQ:1;
            __IO uint8_t  FRIIE:1;
            __IO uint8_t  FLSTE:1;
                 uint8_t  RESV1:1;
            __IO uint8_t  FTST:2;
    } bit;
} FCR14,FCR15,FCR16,FCR17;

