iruka-/ARM_BOOTLOADER/firmware/fm3/drivers/usbf/MB9B500.h
typedef union {
    uint8_t  byte;
    struct {
            __IO uint8_t  FE:2;
            __IO uint8_t  FCL:2;
            __IO uint8_t  FSET:1;
            __IO uint8_t  FLD:1;
            __I  uint8_t  FLST:1;
                 uint8_t  RESV1:1;
    } bit;
} FCR04,FCR05,FCR06,FCR07;

/* base address */
#define BASEADDR_CLK        (0x40010000)
#define BASEADDR_BT0        (0x40025000)
#define BASEADDR_BT1        (0x40025040)
#define BASEADDR_BT2        (0x40025080)
#define BASEADDR_BT3        (0x400250C0)
#define BASEADDR_BT4        (0x40025200)
#define BASEADDR_BT5        (0x40025240)
#define BASEADDR_BT6        (0x40025280)
#define BASEADDR_BT7        (0x400252C0)
#define BASEADDR_GPIO       (0x40033000)
#define BASEADDR_USBCLK     (0x40036000)
#define BASEADDR_USB        (0x40040000)
#define BASEADDR_DMAC       (0x40060000)
#define BASEADDR_MFS0       (0x40038000)
#define BASEADDR_MFS1       (0x40038100)
#define BASEADDR_MFS2       (0x40038200)
#define BASEADDR_MFS3       (0x40038300)
#define BASEADDR_MFS4       (0x40038400)
#define BASEADDR_MFS5       (0x40038500)
#define BASEADDR_MFS6       (0x40038600)
#define BASEADDR_MFS7       (0x40038700)
#define BASEADDR_HWWDT      (0x40011000)
#define BASEADDR_INTREQ     (0x40031000)


/* CSIO control register */
#define IO_SMR0           (*(SMR0*)(BASEADDR_MFS0 + 0x0000))
#define IO_SMR1           (*(SMR1*)(BASEADDR_MFS1 + 0x0000))
#define IO_SMR2           (*(SMR2*)(BASEADDR_MFS2 + 0x0000))
#define IO_SMR3           (*(SMR3*)(BASEADDR_MFS3 + 0x0000))
#define IO_SMR4           (*(SMR4*)(BASEADDR_MFS4 + 0x0000))
#define IO_SMR5           (*(SMR5*)(BASEADDR_MFS5 + 0x0000))
#define IO_SMR6           (*(SMR6*)(BASEADDR_MFS6 + 0x0000))
#define IO_SMR7           (*(SMR7*)(BASEADDR_MFS7 + 0x0000))

#define IO_SCR0           (*(SCR0*)(BASEADDR_MFS0 + 0x0001))
#define IO_SCR1           (*(SCR1*)(BASEADDR_MFS1 + 0x0001))
#define IO_SCR2           (*(SCR2*)(BASEADDR_MFS2 + 0x0001))
#define IO_SCR3           (*(SCR3*)(BASEADDR_MFS3 + 0x0001))
#define IO_SCR4           (*(SCR4*)(BASEADDR_MFS4 + 0x0001))
#define IO_SCR5           (*(SCR5*)(BASEADDR_MFS5 + 0x0001))
#define IO_SCR6           (*(SCR6*)(BASEADDR_MFS6 + 0x0001))
#define IO_SCR7           (*(SCR7*)(BASEADDR_MFS7 + 0x0001))

#define IO_ESCR0          (*(ESCR0*)(BASEADDR_MFS0 + 0x0004))
#define IO_ESCR1          (*(ESCR1*)(BASEADDR_MFS1 + 0x0004))
#define IO_ESCR2          (*(ESCR2*)(BASEADDR_MFS2 + 0x0004))
#define IO_ESCR3          (*(ESCR3*)(BASEADDR_MFS3 + 0x0004))
#define IO_ESCR4          (*(ESCR4*)(BASEADDR_MFS4 + 0x0004))
#define IO_ESCR5          (*(ESCR5*)(BASEADDR_MFS5 + 0x0004))
#define IO_ESCR6          (*(ESCR6*)(BASEADDR_MFS6 + 0x0004))
#define IO_ESCR7          (*(ESCR7*)(BASEADDR_MFS7 + 0x0004))

#define IO_SSR0           (*(SSR0*)(BASEADDR_MFS0 + 0x0005))
#define IO_SSR1           (*(SSR1*)(BASEADDR_MFS1 + 0x0005))
#define IO_SSR2           (*(SSR2*)(BASEADDR_MFS2 + 0x0005))
#define IO_SSR3           (*(SSR3*)(BASEADDR_MFS3 + 0x0005))
#define IO_SSR4           (*(SSR4*)(BASEADDR_MFS4 + 0x0005))
#define IO_SSR5           (*(SSR5*)(BASEADDR_MFS5 + 0x0005))
#define IO_SSR6           (*(SSR6*)(BASEADDR_MFS6 + 0x0005))
#define IO_SSR7           (*(SSR7*)(BASEADDR_MFS7 + 0x0005))

#define IO_RDR0           (*(__I uint16_t*)(BASEADDR_MFS0 + 0x0008))
#define IO_RDR1           (*(__I uint16_t*)(BASEADDR_MFS1 + 0x0008))
#define IO_RDR2           (*(__I uint16_t*)(BASEADDR_MFS2 + 0x0008))
#define IO_RDR3           (*(__I uint16_t*)(BASEADDR_MFS3 + 0x0008))
#define IO_RDR4           (*(__I uint16_t*)(BASEADDR_MFS4 + 0x0008))
#define IO_RDR5           (*(__I uint16_t*)(BASEADDR_MFS5 + 0x0008))
#define IO_RDR6           (*(__I uint16_t*)(BASEADDR_MFS6 + 0x0008))
#define IO_RDR7           (*(__I uint16_t*)(BASEADDR_MFS7 + 0x0008))

#define IO_TDR0           (*(__O uint16_t*)(BASEADDR_MFS0 + 0x0008))
#define IO_TDR1           (*(__O uint16_t*)(BASEADDR_MFS1 + 0x0008))
#define IO_TDR2           (*(__O uint16_t*)(BASEADDR_MFS2 + 0x0008))
#define IO_TDR3           (*(__O uint16_t*)(BASEADDR_MFS3 + 0x0008))
#define IO_TDR4           (*(__O uint16_t*)(BASEADDR_MFS4 + 0x0008))
#define IO_TDR5           (*(__O uint16_t*)(BASEADDR_MFS5 + 0x0008))
#define IO_TDR6           (*(__O uint16_t*)(BASEADDR_MFS6 + 0x0008))
#define IO_TDR7           (*(__O uint16_t*)(BASEADDR_MFS7 + 0x0008))

#define IO_BGR00          (*(__IO uint8_t*)(BASEADDR_MFS0 + 0x000C))
#define IO_BGR01          (*(__IO uint8_t*)(BASEADDR_MFS1 + 0x000C))
#define IO_BGR02          (*(__IO uint8_t*)(BASEADDR_MFS2 + 0x000C))
#define IO_BGR03          (*(__IO uint8_t*)(BASEADDR_MFS3 + 0x000C))
#define IO_BGR04          (*(__IO uint8_t*)(BASEADDR_MFS4 + 0x000C))
#define IO_BGR05          (*(__IO uint8_t*)(BASEADDR_MFS5 + 0x000C))
#define IO_BGR06          (*(__IO uint8_t*)(BASEADDR_MFS6 + 0x000C))
#define IO_BGR07          (*(__IO uint8_t*)(BASEADDR_MFS7 + 0x000C))

#define IO_BGR10          (*(__IO uint8_t*)(BASEADDR_MFS0 + 0x000D))
#define IO_BGR11          (*(__IO uint8_t*)(BASEADDR_MFS1 + 0x000D))
#define IO_BGR12          (*(__IO uint8_t*)(BASEADDR_MFS2 + 0x000D))
#define IO_BGR13          (*(__IO uint8_t*)(BASEADDR_MFS3 + 0x000D))
#define IO_BGR14          (*(__IO uint8_t*)(BASEADDR_MFS4 + 0x000D))
#define IO_BGR15          (*(__IO uint8_t*)(BASEADDR_MFS5 + 0x000D))
#define IO_BGR16          (*(__IO uint8_t*)(BASEADDR_MFS6 + 0x000D))
#define IO_BGR17          (*(__IO uint8_t*)(BASEADDR_MFS7 + 0x000D))

#define IO_ISBA0           (*(ISBA0*)(BASEADDR_MFS0 + 0x0010))
#define IO_ISBA1           (*(ISBA1*)(BASEADDR_MFS1 + 0x0010))
#define IO_ISBA2           (*(ISBA2*)(BASEADDR_MFS2 + 0x0010))
#define IO_ISBA3           (*(ISBA3*)(BASEADDR_MFS3 + 0x0010))
#define IO_ISBA4           (*(ISBA4*)(BASEADDR_MFS4 + 0x0010))
#define IO_ISBA5           (*(ISBA5*)(BASEADDR_MFS5 + 0x0010))
#define IO_ISBA6           (*(ISBA6*)(BASEADDR_MFS6 + 0x0010))
#define IO_ISBA7           (*(ISBA7*)(BASEADDR_MFS7 + 0x0010))

#define IO_ISMK0           (*(ISMK0*)(BASEADDR_MFS0 + 0x0011))
#define IO_ISMK1           (*(ISMK1*)(BASEADDR_MFS1 + 0x0011))
#define IO_ISMK2           (*(ISMK2*)(BASEADDR_MFS2 + 0x0011))
#define IO_ISMK3           (*(ISMK3*)(BASEADDR_MFS3 + 0x0011))
#define IO_ISMK4           (*(ISMK4*)(BASEADDR_MFS4 + 0x0011))
#define IO_ISMK5           (*(ISMK5*)(BASEADDR_MFS5 + 0x0011))
#define IO_ISMK6           (*(ISMK6*)(BASEADDR_MFS6 + 0x0011))
#define IO_ISMK7           (*(ISMK7*)(BASEADDR_MFS7 + 0x0011))

#define IO_FCR04           (*(FCR04*)(BASEADDR_MFS4 + 0x0014))
#define IO_FCR05           (*(FCR05*)(BASEADDR_MFS5 + 0x0014))
#define IO_FCR06           (*(FCR06*)(BASEADDR_MFS6 + 0x0014))
#define IO_FCR07           (*(FCR07*)(BASEADDR_MFS7 + 0x0014))

