iruka-/ARM_BOOTLOADER/firmware/fm3/drivers/usbf/MB9B500.h
#define IO_FCR14           (*(FCR14*)(BASEADDR_MFS4 + 0x0015))
#define IO_FCR15           (*(FCR15*)(BASEADDR_MFS5 + 0x0015))
#define IO_FCR16           (*(FCR16*)(BASEADDR_MFS6 + 0x0015))
#define IO_FCR17           (*(FCR17*)(BASEADDR_MFS7 + 0x0015))

#define IO_FBYTE14         (*(__IO uint8_t*)(BASEADDR_MFS4 + 0x0018))
#define IO_FBYTE15         (*(__IO uint8_t*)(BASEADDR_MFS5 + 0x0018))
#define IO_FBYTE16         (*(__IO uint8_t*)(BASEADDR_MFS6 + 0x0018))
#define IO_FBYTE17         (*(__IO uint8_t*)(BASEADDR_MFS7 + 0x0018))

#define IO_FBYTE24         (*(__IO uint8_t*)(BASEADDR_MFS4 + 0x0019))
#define IO_FBYTE25         (*(__IO uint8_t*)(BASEADDR_MFS5 + 0x0019))
#define IO_FBYTE26         (*(__IO uint8_t*)(BASEADDR_MFS6 + 0x0019))
#define IO_FBYTE27         (*(__IO uint8_t*)(BASEADDR_MFS7 + 0x0019))

/* base timer register */
#define IO_BTSEL0123      (*(BTSEL0123*)(0x40025101))
#define IO_BTSEL4567      (*(BTSEL4567*)(0x40025301))
#define IO_BTSSSR         (*(BTSSSR*)(0x40025FFC))

#define IO_PCSR0          (*(__IO uint16_t*)(BASEADDR_BT0 + 0x0000))
#define IO_PCSR1          (*(__IO uint16_t*)(BASEADDR_BT1 + 0x0000))
#define IO_PCSR2          (*(__IO uint16_t*)(BASEADDR_BT2 + 0x0000))
#define IO_PCSR3          (*(__IO uint16_t*)(BASEADDR_BT3 + 0x0000))
#define IO_PCSR4          (*(__IO uint16_t*)(BASEADDR_BT4 + 0x0000))
#define IO_PCSR5          (*(__IO uint16_t*)(BASEADDR_BT5 + 0x0000))
#define IO_PCSR6          (*(__IO uint16_t*)(BASEADDR_BT6 + 0x0000))
#define IO_PCSR7          (*(__IO uint16_t*)(BASEADDR_BT7 + 0x0000))

#define IO_PRLL0          (*(__IO uint16_t*)(BASEADDR_BT0 + 0x0000))
#define IO_PRLL1          (*(__IO uint16_t*)(BASEADDR_BT1 + 0x0000))
#define IO_PRLL2          (*(__IO uint16_t*)(BASEADDR_BT2 + 0x0000))
#define IO_PRLL3          (*(__IO uint16_t*)(BASEADDR_BT3 + 0x0000))
#define IO_PRLL4          (*(__IO uint16_t*)(BASEADDR_BT4 + 0x0000))
#define IO_PRLL5          (*(__IO uint16_t*)(BASEADDR_BT5 + 0x0000))
#define IO_PRLL6          (*(__IO uint16_t*)(BASEADDR_BT6 + 0x0000))
#define IO_PRLL7          (*(__IO uint16_t*)(BASEADDR_BT7 + 0x0000))

#define IO_PDUT0          (*(__IO uint16_t*)(BASEADDR_BT0 + 0x0004))
#define IO_PDUT1          (*(__IO uint16_t*)(BASEADDR_BT1 + 0x0004))
#define IO_PDUT2          (*(__IO uint16_t*)(BASEADDR_BT2 + 0x0004))
#define IO_PDUT3          (*(__IO uint16_t*)(BASEADDR_BT3 + 0x0004))
#define IO_PDUT4          (*(__IO uint16_t*)(BASEADDR_BT4 + 0x0004))
#define IO_PDUT5          (*(__IO uint16_t*)(BASEADDR_BT5 + 0x0004))
#define IO_PDUT6          (*(__IO uint16_t*)(BASEADDR_BT6 + 0x0004))
#define IO_PDUT7          (*(__IO uint16_t*)(BASEADDR_BT7 + 0x0004))

#define IO_PRLH0          (*(__IO uint16_t*)(BASEADDR_BT0 + 0x0004))
#define IO_PRLH1          (*(__IO uint16_t*)(BASEADDR_BT1 + 0x0004))
#define IO_PRLH2          (*(__IO uint16_t*)(BASEADDR_BT2 + 0x0004))
#define IO_PRLH3          (*(__IO uint16_t*)(BASEADDR_BT3 + 0x0004))
#define IO_PRLH4          (*(__IO uint16_t*)(BASEADDR_BT4 + 0x0004))
#define IO_PRLH5          (*(__IO uint16_t*)(BASEADDR_BT5 + 0x0004))
#define IO_PRLH6          (*(__IO uint16_t*)(BASEADDR_BT6 + 0x0004))
#define IO_PRLH7          (*(__IO uint16_t*)(BASEADDR_BT7 + 0x0004))

#define IO_DTBF0          (*(__I  uint16_t*)(BASEADDR_BT0 + 0x0004))
#define IO_DTBF1          (*(__I  uint16_t*)(BASEADDR_BT1 + 0x0004))
#define IO_DTBF2          (*(__I  uint16_t*)(BASEADDR_BT2 + 0x0004))
#define IO_DTBF3          (*(__I  uint16_t*)(BASEADDR_BT3 + 0x0004))
#define IO_DTBF4          (*(__I  uint16_t*)(BASEADDR_BT4 + 0x0004))
#define IO_DTBF5          (*(__I  uint16_t*)(BASEADDR_BT5 + 0x0004))
#define IO_DTBF6          (*(__I  uint16_t*)(BASEADDR_BT6 + 0x0004))
#define IO_DTBF7          (*(__I  uint16_t*)(BASEADDR_BT7 + 0x0004))

#define IO_TMR0           (*(__I uint16_t*)(BASEADDR_BT0 + 0x0008))
#define IO_TMR1           (*(__I uint16_t*)(BASEADDR_BT1 + 0x0008))
#define IO_TMR2           (*(__I uint16_t*)(BASEADDR_BT2 + 0x0008))
#define IO_TMR3           (*(__I uint16_t*)(BASEADDR_BT3 + 0x0008))
#define IO_TMR4           (*(__I uint16_t*)(BASEADDR_BT4 + 0x0008))
#define IO_TMR5           (*(__I uint16_t*)(BASEADDR_BT5 + 0x0008))
#define IO_TMR6           (*(__I uint16_t*)(BASEADDR_BT6 + 0x0008))
#define IO_TMR7           (*(__I uint16_t*)(BASEADDR_BT7 + 0x0008))

#define IO_TMCR0          (*(TMCR0*)(BASEADDR_BT0 + 0x000C))
#define IO_TMCR1          (*(TMCR1*)(BASEADDR_BT1 + 0x000C))
#define IO_TMCR2          (*(TMCR2*)(BASEADDR_BT2 + 0x000C))
#define IO_TMCR3          (*(TMCR3*)(BASEADDR_BT3 + 0x000C))
#define IO_TMCR4          (*(TMCR4*)(BASEADDR_BT4 + 0x000C))
#define IO_TMCR5          (*(TMCR5*)(BASEADDR_BT5 + 0x000C))
#define IO_TMCR6          (*(TMCR6*)(BASEADDR_BT6 + 0x000C))
#define IO_TMCR7          (*(TMCR7*)(BASEADDR_BT7 + 0x000C))

#define IO_STC0           (*(STC0*)(BASEADDR_BT0 + 0x0010))
#define IO_STC1           (*(STC1*)(BASEADDR_BT1 + 0x0010))
#define IO_STC2           (*(STC2*)(BASEADDR_BT2 + 0x0010))
#define IO_STC3           (*(STC3*)(BASEADDR_BT3 + 0x0010))
#define IO_STC4           (*(STC4*)(BASEADDR_BT4 + 0x0010))
#define IO_STC5           (*(STC5*)(BASEADDR_BT5 + 0x0010))
#define IO_STC6           (*(STC6*)(BASEADDR_BT6 + 0x0010))
#define IO_STC7           (*(STC7*)(BASEADDR_BT7 + 0x0010))

#define IO_TMCR20         (*(TMCR20 *)(BASEADDR_BT0 + 0x0011))
#define IO_TMCR21         (*(TMCR21 *)(BASEADDR_BT1 + 0x0011))
#define IO_TMCR22         (*(TMCR22 *)(BASEADDR_BT2 + 0x0011))
#define IO_TMCR23         (*(TMCR23 *)(BASEADDR_BT3 + 0x0011))
#define IO_TMCR24         (*(TMCR24 *)(BASEADDR_BT4 + 0x0011))
#define IO_TMCR25         (*(TMCR25 *)(BASEADDR_BT5 + 0x0011))
#define IO_TMCR26         (*(TMCR26 *)(BASEADDR_BT6 + 0x0011))
#define IO_TMCR27         (*(TMCR27 *)(BASEADDR_BT7 + 0x0011))

/* clock generation register */
#define IO_SCM_CTL      (*(SCM_CTL*)(BASEADDR_CLK + 0x0000))
#define IO_SCM_STR      (*(SCM_STR*)(BASEADDR_CLK + 0x0004))
#define IO_BSC_PSR      (*(BSC_PSR*)(BASEADDR_CLK + 0x0010))
#define IO_APBC0_PSR    (*(APBC0_PSR*)(BASEADDR_CLK + 0x0014))
#define IO_APBC1_PSR    (*(APBC1_PSR*)(BASEADDR_CLK + 0x0018))
#define IO_APBC2_PSR    (*(APBC2_PSR*)(BASEADDR_CLK + 0x001C))
#define IO_SWC_PSR      (*(SWC_PSR*)(BASEADDR_CLK + 0x0020))
#define IO_TTC_PSR      (*(TTC_PSR*)(BASEADDR_CLK + 0x0028))
#define IO_CSW_TMR      (*(CSW_TMR*)(BASEADDR_CLK + 0x0030))
#define IO_PSW_TMR      (*(PSW_TMR*)(BASEADDR_CLK + 0x0034))
#define IO_PLL_CTL1     (*(PLL_CTL1*)(BASEADDR_CLK + 0x0038))
#define IO_PLL_CTL2     (*(PLL_CTL2*)(BASEADDR_CLK + 0x003C))
#define IO_DBWDT_CTL    (*(DBWDT_CTL*)(BASEADDR_CLK + 0x0054))
#define IO_INT_ENR      (*(INT_ENR*)(BASEADDR_CLK + 0x0060))
#define IO_INT_STR      (*(INT_STR*)(BASEADDR_CLK + 0x0064))
#define IO_INT_CLR      (*(INT_CLR*)(BASEADDR_CLK + 0x0068))

/* I/O port control register */
#define IO_PFR0        (*(PFR0*)(BASEADDR_GPIO + 0x0000))
#define IO_PFR1        (*(PFR1*)(BASEADDR_GPIO + 0x0004))
#define IO_PFR2        (*(PFR2*)(BASEADDR_GPIO + 0x0008))
#define IO_PFR3        (*(PFR3*)(BASEADDR_GPIO + 0x000C))
#define IO_PFR4        (*(PFR4*)(BASEADDR_GPIO + 0x0010))
#define IO_PFR5        (*(PFR5*)(BASEADDR_GPIO + 0x0014))
#define IO_PFR6        (*(PFR6*)(BASEADDR_GPIO + 0x0018))
#define IO_PFR7        (*(PFR7*)(BASEADDR_GPIO + 0x001C))

#define IO_PCR0        (*(PCR0*)(BASEADDR_GPIO + 0x0100))
#define IO_PCR1        (*(PCR1*)(BASEADDR_GPIO + 0x0104))
#define IO_PCR2        (*(PCR2*)(BASEADDR_GPIO + 0x0108))
#define IO_PCR3        (*(PCR3*)(BASEADDR_GPIO + 0x010C))
#define IO_PCR4        (*(PCR4*)(BASEADDR_GPIO + 0x0110))
#define IO_PCR5        (*(PCR5*)(BASEADDR_GPIO + 0x0114))
#define IO_PCR6        (*(PCR6*)(BASEADDR_GPIO + 0x0118))
#define IO_PCR7        (*(PCR7*)(BASEADDR_GPIO + 0x011C))

#define IO_DDR0        (*(DDR0*)(BASEADDR_GPIO + 0x0200))
#define IO_DDR1        (*(DDR1*)(BASEADDR_GPIO + 0x0204))
#define IO_DDR2        (*(DDR2*)(BASEADDR_GPIO + 0x0208))
#define IO_DDR3        (*(DDR3*)(BASEADDR_GPIO + 0x020C))
#define IO_DDR4        (*(DDR4*)(BASEADDR_GPIO + 0x0210))
#define IO_DDR5        (*(DDR5*)(BASEADDR_GPIO + 0x0214))
#define IO_DDR6        (*(DDR6*)(BASEADDR_GPIO + 0x0218))
#define IO_DDR7        (*(DDR7*)(BASEADDR_GPIO + 0x021C))

