iruka-/ARM_BOOTLOADER/firmware/fm3/drivers/usbf/MB9B500.h
#define IO_PDIR0       (*(PDIR0*)(BASEADDR_GPIO + 0x0300))
#define IO_PDIR1       (*(PDIR1*)(BASEADDR_GPIO + 0x0304))
#define IO_PDIR2       (*(PDIR2*)(BASEADDR_GPIO + 0x0308))
#define IO_PDIR3       (*(PDIR3*)(BASEADDR_GPIO + 0x030C))
#define IO_PDIR4       (*(PDIR4*)(BASEADDR_GPIO + 0x0310))
#define IO_PDIR5       (*(PDIR5*)(BASEADDR_GPIO + 0x0314))
#define IO_PDIR6       (*(PDIR6*)(BASEADDR_GPIO + 0x0318))
#define IO_PDIR7       (*(PDIR7*)(BASEADDR_GPIO + 0x031C))

#define IO_PDOR0       (*(PDOR0*)(BASEADDR_GPIO + 0x0400))
#define IO_PDOR1       (*(PDOR1*)(BASEADDR_GPIO + 0x0404))
#define IO_PDOR2       (*(PDOR2*)(BASEADDR_GPIO + 0x0408))
#define IO_PDOR3       (*(PDOR3*)(BASEADDR_GPIO + 0x040C))
#define IO_PDOR4       (*(PDOR4*)(BASEADDR_GPIO + 0x0410))
#define IO_PDOR5       (*(PDOR5*)(BASEADDR_GPIO + 0x0414))
#define IO_PDOR6       (*(PDOR6*)(BASEADDR_GPIO + 0x0418))
#define IO_PDOR7       (*(PDOR7*)(BASEADDR_GPIO + 0x041C))

#define IO_ADE         (*(ADE*)(BASEADDR_GPIO + 0x0500))

#define IO_EPFR00      (*(EPFR00*)(BASEADDR_GPIO + 0x0600))
#define IO_EPFR01      (*(EPFR01*)(BASEADDR_GPIO + 0x0604))
#define IO_EPFR02      (*(EPFR02*)(BASEADDR_GPIO + 0x0608))
#define IO_EPFR04      (*(EPFR04*)(BASEADDR_GPIO + 0x0610))
#define IO_EPFR05      (*(EPFR05*)(BASEADDR_GPIO + 0x0614))
#define IO_EPFR06      (*(EPFR06*)(BASEADDR_GPIO + 0x0618))
#define IO_EPFR07      (*(EPFR07*)(BASEADDR_GPIO + 0x061C))
#define IO_EPFR08      (*(EPFR08*)(BASEADDR_GPIO + 0x0620))
#define IO_EPFR09      (*(EPFR09*)(BASEADDR_GPIO + 0x0624))
#define IO_EPFR10      (*(EPFR10*)(BASEADDR_GPIO + 0x0628))

/* USB clock generation register */
#define IO_UCCR         (*(UCCR*)(BASEADDR_USBCLK + 0x0000))
#define IO_UPCR1        (*(UPCR1*)(BASEADDR_USBCLK + 0x0004))
#define IO_UPCR2        (*(UPCR2*)(BASEADDR_USBCLK + 0x0008))
#define IO_UPCR3        (*(UPCR3*)(BASEADDR_USBCLK + 0x000C))
#define IO_UPCR4        (*(UPCR4*)(BASEADDR_USBCLK + 0x0010))
#define IO_UP_STR       (*(UP_STR*)(BASEADDR_USBCLK + 0x0014))
#define IO_UPINT_ENR    (*(UPINT_ENR*)(BASEADDR_USBCLK + 0x0018))
#define IO_UPINT_CLR    (*(UPINT_CLR*)(BASEADDR_USBCLK + 0x001C))
#define IO_UPIN_STR     (*(UPIN_STR*)(BASEADDR_USBCLK + 0x0020))
#define IO_USBEN        (*(USBEN*)(BASEADDR_USBCLK + 0x0030))

/* USB control register */
#define IO_HCNT         (*(HCNT*)(BASEADDR_USB + 0x2100))
#define IO_HIRQ         (*(HIRQ*)(BASEADDR_USB + 0x2104))
#define IO_HERR         (*(HERR*)(BASEADDR_USB + 0x2105))
#define IO_HSTATE       (*(HSTATE*)(BASEADDR_USB + 0x2108))
#define IO_HFCOMP       (*(__IO uint8_t*)(BASEADDR_USB + 0x2109))
#define IO_HRTIMER10    (*(__IO uint16_t*)(BASEADDR_USB + 0x210C))
#define IO_HRTIMER2     (*(__IO uint8_t*)(BASEADDR_USB + 0x2110))
#define IO_HADR         (*(__IO uint8_t*)(BASEADDR_USB + 0x2111))
#define IO_HEOF         (*(HEOF*)(BASEADDR_USB + 0x2114))
#define IO_HFRAME       (*(HFRAME*)(BASEADDR_USB + 0x2118))
#define IO_HTOKEN       (*(HTOKEN*)(BASEADDR_USB + 0x211C))
#define IO_UDCC         (*(UDCC*)(BASEADDR_USB + 0x2120))
#define IO_EP0C         (*(EP0C*)(BASEADDR_USB + 0x2124))
#define IO_EP1C         (*(EP1C*)(BASEADDR_USB + 0x2128))
#define IO_EP2C         (*(EP2C*)(BASEADDR_USB + 0x212C))
#define IO_EP3C         (*(EP3C*)(BASEADDR_USB + 0x2130))
#define IO_EP4C         (*(EP4C*)(BASEADDR_USB + 0x2134))
#define IO_EP5C         (*(EP5C*)(BASEADDR_USB + 0x2138))
#define IO_TMSP         (*(__I uint16_t*)(BASEADDR_USB + 0x213C))
#define IO_UDCS         (*(UDCS*)(BASEADDR_USB + 0x2140))
#define IO_UDCIE        (*(UDCIE*)(BASEADDR_USB + 0x2141))
#define IO_EP0IS        (*(EP0IS*)(BASEADDR_USB + 0x2144))
#define IO_EP0OS        (*(EP0OS*)(BASEADDR_USB + 0x2148))
#define IO_EP1S         (*(EP1S*)(BASEADDR_USB + 0x214C))
#define IO_EP2S         (*(EP2S*)(BASEADDR_USB + 0x2150))
#define IO_EP3S         (*(EP3S*)(BASEADDR_USB + 0x2154))
#define IO_EP4S         (*(EP4S*)(BASEADDR_USB + 0x2158))
#define IO_EP5S         (*(EP5S*)(BASEADDR_USB + 0x215C))
#define IO_EP0DT        (*(EP0DT*)(BASEADDR_USB + 0x2160))
#define IO_EP1DT        (*(EP1DT*)(BASEADDR_USB + 0x2164))
#define IO_EP2DT        (*(EP2DT*)(BASEADDR_USB + 0x2168))
#define IO_EP3DT        (*(EP3DT*)(BASEADDR_USB + 0x216C))
#define IO_EP4DT        (*(EP4DT*)(BASEADDR_USB + 0x2170))
#define IO_EP5DT        (*(EP5DT*)(BASEADDR_USB + 0x2174))

/* DMA control register */
#define IO_DMACR        (*(DMACR*)(BASEADDR_DMAC + 0x0000))
#define IO_DMACA0       (*(DMACA0*)(BASEADDR_DMAC + 0x0010))
#define IO_DMACB0       (*(DMACB0*)(BASEADDR_DMAC + 0x0014))
#define IO_DMACSA0      (*(__IO uint32_t*)(BASEADDR_DMAC + 0x0018))
#define IO_DMACDA0      (*(__IO uint32_t*)(BASEADDR_DMAC + 0x001C))
#define IO_DMACA1       (*(DMACA1*)(BASEADDR_DMAC + 0x0020))
#define IO_DMACB1       (*(DMACB1*)(BASEADDR_DMAC + 0x0024))
#define IO_DMACSA1      (*(__IO uint32_t*)(BASEADDR_DMAC + 0x0028))
#define IO_DMACDA1      (*(__IO uint32_t*)(BASEADDR_DMAC + 0x002C))

/* HW_WDT */
#define	IO_WDG_CTL      (*(__IO uint8_t*)(BASEADDR_HWWDT + 0x0008))
#define	IO_WDG_LCK	    (*(__IO uint32_t*)(BASEADDR_HWWDT + 0x0C00))

/* interrupt request register */
#define	IO_DRQSEL       (*(__IO uint32_t*)(BASEADDR_INTREQ + 0x0000))

#endif

